USE martgodb;
INSERT INTO warehouse (warehouse_id, warehouse_name, location, height, width, FAR, status)
VALUES (1, '서울창고', '서울특별시 강동구', 50, 100000, 0.00, '사용가능'),
       (2, '부산창고', '부산광역시 사하구', 80, 50000, 0.00, '사용가능'),
       (3, '대전창고', '대전광역시 서구', 90, 48000, 0.00, '사용가능'),
       (4, '대구창고', '대구광역시 중구', 110, 40000, 0.00, '사용가능');

-- 섹터 테이블 (sector) 더미 데이터 (각 창고에 4개의 섹터 배정)
-- 섹터 테이블 (sector) 더미 데이터 (섹터 크기 다르게)
INSERT INTO sector (sector_id, warehouse_id, height, width, FAR, status)
VALUES
-- 창고 1 (서울창고)
('1A', 1, 50, 20000, 0.00, '사용가능'),
('1B', 1, 50, 25000, 0.00, '사용가능'),
('1C', 1, 50, 27000, 0.00, '사용가능'),
('1D', 1, 50, 28000, 0.00, '사용가능'),

('2A', 2, 80, 9000, 0.00, '사용가능'),
('2B', 2, 80, 11000, 0.00, '사용가능'),
('2C', 2, 80, 14000, 0.00, '사용가능'),
('2D', 2, 80, 16000, 0.00, '사용가능'),

-- 대전창고
('3A', 3, 90, 10000, 0.00, '사용가능'),
('3B', 3, 90, 12000, 0.00, '사용가능'),
('3C', 3, 90, 13000, 0.00, '사용가능'),
('3D', 3, 90, 13000, 0.00, '사용가능'),

-- 대구창고
('4A', 4, 110, 9000, 0.00, '사용가능'),
('4B', 4, 110, 10000, 0.00, '사용가능'),
('4C', 4, 110, 10000, 0.00, '사용가능'),
('4D', 4, 110, 11000, 0.00, '사용가능');


-- 비용 정보 테이블 (cost_info) 더미 데이터
INSERT INTO cost_info (warehouse_id, sector_id, period, price)
VALUES
-- 창고 1 - 섹터 1A
(1, '1A', '1개월', 300000),
(1, '1A', '3개월', 850000),
(1, '1A', '6개월', 1600000),
(1, '1A', '12개월', 3000000),
-- 창고 1 - 섹터 1B
(1, '1B', '1개월', 320000),
(1, '1B', '3개월', 900000),
(1, '1B', '6개월', 1700000),
(1, '1B', '12개월', 3200000),
-- 창고 1 - 섹터 1C
(1, '1C', '1개월', 340000),
(1, '1C', '3개월', 950000),
(1, '1C', '6개월', 1800000),
(1, '1C', '12개월', 3400000),
-- 창고 1 - 섹터 1D
(1, '1D', '1개월', 360000),
(1, '1D', '3개월', 1000000),
(1, '1D', '6개월', 1900000),
(1, '1D', '12개월', 3600000),

-- 창고 2 - 섹터 2A
(2, '2A', '1개월', 400000),
(2, '2A', '3개월', 1100000),
(2, '2A', '6개월', 2100000),
(2, '2A', '12개월', 4000000),
-- 창고 2 - 섹터 2B
(2, '2B', '1개월', 380000),
(2, '2B', '3개월', 1050000),
(2, '2B', '6개월', 2000000),
(2, '2B', '12개월', 3800000),
-- 창고 2 - 섹터 2C
(2, '2C', '1개월', 360000),
(2, '2C', '3개월', 1000000),
(2, '2C', '6개월', 1900000),
(2, '2C', '12개월', 3600000),
-- 창고 2 - 섹터 2D
(2, '2D', '1개월', 340000),
(2, '2D', '3개월', 950000),
(2, '2D', '6개월', 1800000),
(2, '2D', '12개월', 3400000),

-- 창고 3 - 섹터 3A
(3, '3A', '1개월', 370000),
(3, '3A', '3개월', 1000000),
(3, '3A', '6개월', 1900000),
(3, '3A', '12개월', 3700000),
-- 창고 3 - 섹터 3B
(3, '3B', '1개월', 360000),
(3, '3B', '3개월', 970000),
(3, '3B', '6개월', 1850000),
(3, '3B', '12개월', 3600000),
-- 창고 3 - 섹터 3C
(3, '3C', '1개월', 390000),
(3, '3C', '3개월', 1050000),
(3, '3C', '6개월', 2000000),
(3, '3C', '12개월', 3900000),
-- 창고 3 - 섹터 3D
(3, '3D', '1개월', 400000),
(3, '3D', '3개월', 1080000),
(3, '3D', '6개월', 2100000),
(3, '3D', '12개월', 4000000),

-- 창고 4 - 섹터 4A
(4, '4A', '1개월', 380000),
(4, '4A', '3개월', 1020000),
(4, '4A', '6개월', 1950000),
(4, '4A', '12개월', 3800000),
-- 창고 4 - 섹터 4B
(4, '4B', '1개월', 350000),
(4, '4B', '3개월', 950000),
(4, '4B', '6개월', 1800000),
(4, '4B', '12개월', 3500000),
-- 창고 4 - 섹터 4C
(4, '4C', '1개월', 370000),
(4, '4C', '3개월', 990000),
(4, '4C', '6개월', 1900000),
(4, '4C', '12개월', 3700000),
-- 창고 4 - 섹터 4D
(4, '4D', '1개월', 410000),
(4, '4D', '3개월', 1100000),
(4, '4D', '6개월', 2150000),
(4, '4D', '12개월', 4100000);

-- 총관리자 (창고당 1명)
INSERT INTO admin (admin_id, admin_name, admin_pw, phone_num, email, role, warehouse_id)
VALUES ('admin01', '김총관리', '0', '010-1111-0001', 'admin01@test.com', '총관리자', 1),
       ('admin02', '박총관리', '0', '010-2222-0002', 'admin02@test.com', '총관리자', 2),
       ('admin03', '방총관리', '0', '010-3333-0003', 'admin03@test.com', '총관리자', 3),
       ('admin04', '임총관리', '0', '010-4444-0004', 'admin04@test.com', '총관리자', 4);

-- 창고관리자 (섹터별 1명)
INSERT INTO admin (admin_id, admin_name, admin_pw, phone_num, email, role, warehouse_id)
VALUES
-- 창고 1 - 섹터 1A~1D
('admin05', '이창고관리', '0', '010-5555-0005', 'admin05@test.com', '창고관리자', 1),
('admin06', '정창고관리', '0', '010-6666-0006', 'admin06@test.com', '창고관리자', 1),
('admin07', '최창고관리', '0', '010-7777-0007', 'admin07@test.com', '창고관리자', 1),
('admin08', '한창고관리', '0', '010-8888-0008', 'admin08@test.com', '창고관리자', 1),

-- 창고 2 - 섹터 2A~2D
('admin09', '서창고관리', '0', '010-9999-0009', 'admin09@test.com', '창고관리자', 2),
('admin10', '조창고관리', '0', '010-1010-0010', 'admin10@test.com', '창고관리자', 2),
('admin11', '류창고관리', '0', '010-1111-0011', 'admin11@test.com', '창고관리자', 2),
('admin12', '홍창고관리', '0', '010-1212-0012', 'admin12@test.com', '창고관리자', 2),

-- 창고 3 - 섹터 3A~3D
('admin13', '김창고관리', '0', '010-1313-0013', 'admin13@test.com', '창고관리자', 3),
('admin14', '박창고관리', '0', '010-1414-0014', 'admin14@test.com', '창고관리자', 3),
('admin15', '백창고관리', '0', '010-1515-0015', 'admin15@test.com', '창고관리자', 3),
('admin16', '정창고관리2', '0', '010-1616-0016', 'admin16@test.com', '창고관리자', 3),

-- 창고 4 - 섹터 4A~4D
('admin17', '오창고관리', '0', '010-1717-0017', 'admin17@test.com', '창고관리자', 4),
('admin18', '윤창고관리', '0', '010-1818-0018', 'admin18@test.com', '창고관리자', 4),
('admin19', '문창고관리', '0', '010-1919-0019', 'admin19@test.com', '창고관리자', 4),
('admin20', '안창고관리', '0', '010-2020-0020', 'admin20@test.com', '창고관리자', 4);


-- 일반 회원 (10명 중 5명은 admin_id NULL, 5명은 창고관리자 지정)
INSERT INTO user (user_id, user_name, user_pw, phone, email, address, role, admin_id, salt)
VALUES ('user01', '김철수', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0001',
        'user01@test.com', '서울시 강남구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user02', '이영희', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0002',
        'user02@test.com', '서울시 서초구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user03', '박민수', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0003',
        'user03@test.com', '서울시 송파구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user04', '최수지', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0004',
        'user04@test.com', '서울시 강서구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user05', '한지훈', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0005',
        'user05@test.com', '서울시 관악구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user06', '정다은', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0006',
        'user06@test.com', '서울시 동작구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user07', '강서준', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0007',
        'user07@test.com', '서울시 영등포구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user08', '윤하나', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0008',
        'user08@test.com', '서울시 중구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user09', '조민아', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0009',
        'user09@test.com', '서울시 종로구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user10', '백승우', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0010',
        'user10@test.com', '서울시 은평구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user11', '남윤지', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0011',
        'user11@test.com', '서울시 서대문구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user12', '심재훈', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0012',
        'user12@test.com', '서울시 마포구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user13', '문가영', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0013',
        'user13@test.com', '서울시 용산구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user14', '노지훈', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0014',
        'user14@test.com', '서울시 성동구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user15', '임하늘', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0015',
        'user15@test.com', '서울시 광진구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user16', '오세진', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0016',
        'user16@test.com', '서울시 동대문구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user17', '서동주', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0017',
        'user17@test.com', '서울시 중랑구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user18', '안예진', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0018',
        'user18@test.com', '서울시 성북구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user19', '장민혁', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0019',
        'user19@test.com', '서울시 강북구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user20', '홍채린', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0020',
        'user20@test.com', '서울시 도봉구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785'),


       ('user21', '김예진', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0021',
        'user21@test.com', '서울시 강남구', '회원', 'admin05', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user22', '박채윤', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0022',
        'user22@test.com', '서울시 서초구', '회원', 'admin06', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user23', '이도훈', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0023',
        'user23@test.com', '서울시 송파구', '회원', 'admin07', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user24', '정지후', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0024',
        'user24@test.com', '서울시 강서구', '회원', 'admin08', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user25', '한서연', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0025',
        'user25@test.com', '서울시 영등포구', '회원', 'admin09', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user26', '남하윤', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0026',
        'user26@test.com', '서울시 관악구', '회원', 'admin10', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user27', '서준호', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0027',
        'user27@test.com', '부산시 해운대구', '회원', 'admin11', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user28', '조하은', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0028',
        'user28@test.com', '부산시 사하구', '회원', 'admin12', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user29', '문지민', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0029',
        'user29@test.com', '대전시 유성구', '회원', 'admin13', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user30', '장승우', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0030',
        'user30@test.com', '대전시 서구', '회원', 'admin14', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user31', '배예린', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0031',
        'user31@test.com', '수원시 팔달구', '회원', 'admin15', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user32', '심하진', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0032',
        'user32@test.com', '수원시 영통구', '회원', 'admin16', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user33', '임지후', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0033',
        'user33@test.com', '광주시 북구', '회원', 'admin17', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user34', '윤채은', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0034',
        'user34@test.com', '광주시 서구', '회원', 'admin18', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user35', '강하늘', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0035',
        'user35@test.com', '울산시 남구', '회원', 'admin19', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user36', '오시윤', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0036',
        'user36@test.com', '울산시 중구', '회원', 'admin20', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user37', '남예찬', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0037',
        'user37@test.com', '서울시 강동구', '회원', 'admin05', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user38', '서윤아', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0038',
        'user38@test.com', '서울시 중구', '회원', 'admin06', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user39', '홍도윤', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0039',
        'user39@test.com', '서울시 동대문구', '회원', 'admin07', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user40', '조하준', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-2222-0040',
        'user40@test.com', '서울시 성북구', '회원', 'admin08', 'ac17c952b04ef183950231cdadc24cd746b7c785'),


       ('user41', '이강민', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0041',
        'user41@test.com', '서울시 송파구', '거래처', 'admin13', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user42', '박서준', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0042',
        'user42@test.com', '서울시 강남구', '거래처', 'admin10', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user43', '최하린', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0043',
        'user43@test.com', '서울시 서초구', '거래처', 'admin16', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user44', '김태윤', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0044',
        'user44@test.com', '서울시 중구', '거래처', 'admin06', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user45', '한지우', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0045',
        'user45@test.com', '서울시 영등포구', '거래처', 'admin10', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user46', '윤하진', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0046',
        'user46@test.com', '서울시 종로구', '거래처', 'admin07', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user47', '남윤호', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0047',
        'user47@test.com', '부산시 해운대구', '거래처', 'admin11', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user48', '서다인', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0048',
        'user48@test.com', '부산시 사하구', '거래처', 'admin12', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user49', '백승아', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0049',
        'user49@test.com', '대전시 유성구', '거래처', 'admin13', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user50', '오지호', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0050',
        'user50@test.com', '대전시 서구', '거래처', 'admin09', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user51', '문하윤', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0051',
        'user51@test.com', '수원시 장안구', '거래처', 'admin17', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user52', '장도윤', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0052',
        'user52@test.com', '수원시 권선구', '거래처', 'admin08', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user53', '심하준', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0053',
        'user53@test.com', '광주시 남구', '거래처', 'admin17', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user54', '임채은', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0054',
        'user54@test.com', '광주시 북구', '거래처', 'admin07', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user55', '윤민재', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0055',
        'user55@test.com', '울산시 남구', '거래처', 'admin18', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user56', '강지민', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0056',
        'user56@test.com', '울산시 중구', '거래처', 'admin18', 'ac17c952b04ef183950231cdadc24cd746b7c785'),
       ('user60', '조예앤', '81b515de94cffa9a708295ccd48c25c3b96ccad12d4652094f0b88cb8f5cbe87', '010-1111-0061',
        'user61@test.com', '서울시 강남구', '회원', NULL, 'ac17c952b04ef183950231cdadc24cd746b7c785');



SELECT *
FROM user;


INSERT INTO rent_history (sector_id, warehouse_id, user_id, rent_start_date, rent_end_date, rent_price, approve_date,
                          status,
                          admin_id)
VALUES
-- 대기 상태
-- 대기 상태

('1A', 1, 'user06', '2026-05-01', '2026-10-28', 750000, NULL, '대기', NULL),
('1C', 1, 'user29', '2028-05-01', '2028-10-28', 760000, NULL, '대기', NULL),
('1C', 1, 'user30', '2029-10-29', '2029-04-26', 680000, NULL, '대기', NULL),
('1D', 1, 'user14', '2029-05-01', '2029-10-28', 720000, NULL, '대기', NULL),
('1D', 1, 'user34', '2029-10-29', '2029-12-26', 750000, NULL, '대기', NULL),

('1A', 1, 'user06', '2026-05-01', '2026-10-28', 750000, NULL, '대기', NULL),
('1C', 1, 'user29', '2028-05-01', '2028-10-28', 760000, NULL, '대기', NULL),
('1C', 1, 'user30', '2029-10-29', '2029-04-26', 680000, NULL, '대기', NULL),
('1D', 1, 'user14', '2029-05-01', '2029-10-28', 720000, NULL, '대기', NULL),
('1D', 1, 'user34', '2029-10-29', '2029-12-26', 750000, NULL, '대기', NULL),

('1A', 1, 'user06', '2026-05-01', '2026-10-28', 750000, NULL, '대기', NULL),
('1C', 1, 'user29', '2028-05-01', '2028-10-28', 760000, NULL, '대기', NULL),
('1C', 1, 'user30', '2029-10-29', '2029-04-26', 680000, NULL, '대기', NULL),
('1D', 1, 'user14', '2029-05-01', '2029-10-28', 720000, NULL, '대기', NULL),
('1D', 1, 'user34', '2029-10-29', '2029-12-26', 750000, NULL, '대기', NULL),

('1A', 1, 'user06', '2026-05-01', '2026-10-28', 750000, NULL, '대기', NULL),
('1C', 1, 'user29', '2028-05-01', '2028-10-28', 760000, NULL, '대기', NULL),
('1C', 1, 'user30', '2029-10-29', '2029-04-26', 680000, NULL, '대기', NULL),
('1D', 1, 'user14', '2029-05-01', '2029-10-28', 720000, NULL, '대기', NULL),
('1D', 1, 'user34', '2029-10-29', '2029-12-26', 750000, NULL, '대기', NULL),

('1A', 1, 'user06', '2026-05-01', '2026-10-28', 750000, NULL, '대기', NULL),
('1C', 1, 'user29', '2028-05-01', '2028-10-28', 760000, NULL, '대기', NULL),
('1C', 1, 'user30', '2029-10-29', '2029-04-26', 680000, NULL, '대기', NULL),
('1D', 1, 'user14', '2029-05-01', '2029-10-28', 720000, NULL, '대기', NULL),
('1D', 1, 'user34', '2029-10-29', '2029-12-26', 750000, NULL, '대기', NULL),


('2C', 2, 'user17', '2025-09-01', '2025-10-28', 780000, NULL, '대기', NULL),
('2C', 2, 'user21', '2025-10-29', '2026-04-26', 520000, NULL, '대기', NULL),
('2C', 2, 'user26', '2026-04-27', '2026-10-24', 720000, NULL, '대기', NULL),
('2D', 2, 'user23', '2029-05-01', '2029-10-28', 730000, NULL, '대기', NULL),

('3A', 3, 'user01', '2028-05-01', '2028-10-28', 530000, NULL, '대기', NULL),
('3A', 3, 'user31', '2028-10-29', '2029-04-26', 710000, NULL, '대기', NULL),
('3A', 3, 'user35', '2029-04-28', '2030-10-24', 510000, NULL, '대기', NULL),
('3C', 3, 'user16', '2026-05-01', '2026-10-28', 730000, NULL, '대기', NULL),

('4A', 4, 'user03', '2027-05-01', '2027-10-28', 530000, NULL, '대기', NULL),
('4B', 4, 'user09', '2029-05-01', '2029-10-28', 500000, NULL, '대기', NULL),
('4B', 4, 'user24', '2030-10-29', '2031-04-26', 710000, NULL, '대기', NULL),
('4B', 4, 'user28', '2032-04-28', '2032-10-24', 570000, NULL, '대기', NULL),
('4C', 4, 'user19', '2028-05-30', '2028-10-28', 790000, NULL, '대기', NULL),
('4D', 4, 'user20', '2025-10-29', '2026-04-26', 670000, NULL, '대기', NULL),
('4D', 4, 'user38', '2028-05-28', '2028-10-24', 740000, NULL, '대기', NULL),


('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),

('1C', 1, 'user07', '2027-04-27', '2027-10-24', 600000, NULL, '진행중', 'admin08'),
('1D', 1, 'user33', '2026-10-29', '2027-10-24', 520000, NULL, '진행중', 'admin06'),


('2A', 2, 'user25', '2027-05-01', '2027-10-28', 660000, NULL, '진행중', 'admin10'),
('2B', 2, 'user37', '2027-05-01', '2027-10-28', 760000, NULL, '진행중', 'admin11'),
('2B', 2, 'user40', '2027-10-29', '2027-04-26', 760000, NULL, '진행중', 'admin09'),
('2D', 2, 'user32', '2025-10-29', '2026-04-26', 590000, NULL, '진행중', 'admin09'),

('3A', 3, 'user36', '2027-10-25', '2027-11-23', 530000, NULL, '진행중', 'admin14'),
('3B', 3, 'user02', '2027-05-01', '2027-10-28', 580000, NULL, '진행중', 'admin13'),
('3B', 3, 'user11', '2027-10-29', '2028-04-26', 790000, NULL, '진행중', 'admin15'),
('3B', 3, 'user13', '2028-04-27', '2028-10-24', 720000, NULL, '진행중', 'admin13'),
('3C', 3, 'user08', '2025-10-29', '2026-04-26', 540000, NULL, '진행중', 'admin13'),
('3D', 3, 'user04', '2028-05-01', '2028-10-28', 650000, NULL, '진행중', 'admin14'),
('3D', 3, 'user10', '2029-10-29', '2030-04-26', 560000, NULL, '진행중', 'admin16'),
('3D', 3, 'user22', '2029-04-27', '2029-10-24', 500000, NULL, '진행중', 'admin15'),
('3D', 3, 'user27', '2026-10-25', '2027-04-23', 660000, NULL, '진행중', 'admin14'),

('4B', 4, 'user15', '2026-06-25', '2026-10-23', 760000, NULL, '진행중', 'admin18'),
('4B', 4, 'user18', '2028-04-24', '2028-10-21', 510000, NULL, '진행중', 'admin20'),
('4C', 4, 'user39', '2025-10-29', '2026-04-26', 740000, NULL, '진행중', 'admin17'),
('4D', 4, 'user05', '2026-10-25', '2027-04-23', 530000, NULL, '진행중', 'admin18'),


('1A', 1, 'user44', '2023-04-27', '2023-10-24', 720000, '2023-04-27', '완료', 'admin06'),
('1A', 1, 'user46', '2025-01-01', '2025-10-28', 620000, '2025-01-01', '완료', 'admin07'),
('1A', 1, 'user54', '2027-05-01', '2027-10-28', 580000, '2026-05-01', '완료', 'admin07'),

-- 1B
('1B', 1, 'user52', '2024-05-01', '2024-10-28', 570000, '2024-05-01', '완료', 'admin08'),
('1B', 1, 'user50', '2025-02-01', '2025-10-28', 770000, '2025-02-01', '완료', 'admin09'),
('1B', 1, 'user45', '2026-11-01', '2027-04-30', 750000, '2026-11-01', '완료', 'admin10'),

-- 1C
('1C', 1, 'user47', '2024-11-01', '2025-04-27', 510000, '2024-11-01', '완료', 'admin11'),
('1C', 1, 'user42', '2025-03-01', '2025-09-01', 600000, '2025-03-01', '완료', 'admin10'),
('1C', 1, 'user41', '2026-05-01', '2026-10-28', 740000, '2026-05-01', '완료', 'admin13'),

-- 1D
('1D', 1, 'user43', '2024-05-01', '2024-10-28', 520000, '2024-05-01', '완료', 'admin16'),
('1D', 1, 'user48', '2025-04-01', '2025-10-01', 600000, '2025-04-01', '완료', 'admin15'),
('1D', 1, 'user49', '2026-05-01', '2026-10-28', 510000, '2026-05-01', '완료', 'admin16'),

('2A', 2, 'user44', '2023-05-01', '2023-10-28', 720000, '2023-05-01', '완료', 'admin06'),
('2A', 2, 'user45', '2025-04-01', '2025-10-01', 750000, '2025-04-01', '완료', 'admin10'),
('2A', 2, 'user46', '2026-05-01', '2026-10-28', 620000, '2026-05-01', '완료', 'admin07'),

-- 2B
('2B', 2, 'user47', '2023-11-01', '2024-04-30', 510000, '2023-11-01', '완료', 'admin11'),
('2B', 2, 'user48', '2025-01-01', '2025-07-01', 600000, '2025-01-01', '완료', 'admin15'),
('2B', 2, 'user49', '2026-11-01', '2027-04-30', 510000, '2026-11-01', '완료', 'admin16'),

-- 2C
('2C', 2, 'user50', '2024-05-01', '2024-10-28', 770000, '2024-05-01', '완료', 'admin09'),
('2C', 2, 'user51', '2025-02-01', '2025-08-01', 720000, '2025-02-01', '완료', 'admin17'),
('2C', 2, 'user52', '2027-05-01', '2027-10-28', 570000, '2027-05-01', '완료', 'admin08'),

-- 2D
('2D', 2, 'user53', '2024-11-01', '2025-04-27', 540000, '2024-11-01', '완료', 'admin17'),
('2D', 2, 'user54', '2025-03-01', '2025-09-01', 580000, '2025-03-01', '완료', 'admin07'),
('2D', 2, 'user55', '2027-11-01', '2028-04-30', 730000, '2027-11-01', '완료', 'admin18'),

-- 3A
('3A', 3, 'user56', '2023-05-01', '2023-10-28', 740000, '2023-05-01', '완료', 'admin18'),
('3A', 3, 'user41', '2025-04-01', '2025-10-01', 740000, '2025-04-01', '완료', 'admin13'),
('3A', 3, 'user42', '2026-05-01', '2026-10-28', 600000, '2026-05-01', '완료', 'admin10'),

-- 3B
('3B', 3, 'user43', '2023-11-01', '2024-04-30', 520000, '2023-11-01', '완료', 'admin16'),
('3B', 3, 'user44', '2025-01-01', '2025-07-01', 720000, '2025-01-01', '완료', 'admin06'),
('3B', 3, 'user45', '2026-11-01', '2027-04-30', 750000, '2026-11-01', '완료', 'admin10'),

-- 3C
('3C', 3, 'user46', '2024-05-01', '2024-10-28', 620000, '2024-05-01', '완료', 'admin07'),
('3C', 3, 'user47', '2025-02-01', '2025-08-01', 510000, '2025-02-01', '완료', 'admin11'),
('3C', 3, 'user48', '2027-05-01', '2027-10-28', 600000, '2027-05-01', '완료', 'admin15'),

-- 3D
('3D', 3, 'user49', '2024-11-01', '2025-04-27', 510000, '2024-11-01', '완료', 'admin16'),
('3D', 3, 'user50', '2025-03-01', '2025-09-01', 770000, '2025-03-01', '완료', 'admin09'),
('3D', 3, 'user51', '2027-11-01', '2028-04-30', 720000, '2027-11-01', '완료', 'admin17'),

-- 4A
('4A', 4, 'user52', '2023-05-01', '2023-10-28', 570000, '2023-05-01', '완료', 'admin08'),
('4A', 4, 'user53', '2025-04-01', '2025-10-01', 540000, '2025-04-01', '완료', 'admin17'),
('4A', 4, 'user54', '2026-05-01', '2026-10-28', 580000, '2026-05-01', '완료', 'admin07'),

-- 4B
('4B', 4, 'user55', '2023-11-01', '2024-04-30', 730000, '2023-11-01', '완료', 'admin18'),
('4B', 4, 'user56', '2025-01-01', '2025-07-01', 740000, '2025-01-01', '완료', 'admin18'),
('4B', 4, 'user41', '2026-11-01', '2027-04-30', 740000, '2026-11-01', '완료', 'admin13'),

-- 4C
('4C', 4, 'user42', '2024-05-01', '2024-10-28', 600000, '2024-05-01', '완료', 'admin10'),
('4C', 4, 'user43', '2025-02-01', '2025-08-01', 520000, '2025-02-01', '완료', 'admin16'),
('4C', 4, 'user44', '2027-05-01', '2027-10-28', 720000, '2027-05-01', '완료', 'admin06'),

-- 4D
('4D', 4, 'user45', '2024-11-01', '2025-04-27', 750000, '2024-11-01', '완료', 'admin10'),
('4D', 4, 'user46', '2025-03-01', '2025-09-01', 620000, '2025-03-01', '완료', 'admin07'),
('4D', 4, 'user47', '2027-11-01', '2028-04-30', 510000, '2027-11-01', '완료', 'admin11');

update sector
set status ='사용불가'
where sector_id in (select sector_id from rent_history where rent_end_date > now() and rent_history.status = '완료');

INSERT INTO product (product_id, product_name, category, height, width, price, manufacturer, user_id)
VALUES

-- user41 (완료, 미래 end_date)
('P001', '스마트 TV', '가전제품', 80, 1200, 1500000, '삼성전자', 'user41'),
('P002', '냉장고', '가전제품', 180, 800, 2200000, 'LG전자', 'user41'),
('P003', '세탁기', '가전제품', 90, 700, 1800000, '삼성전자', 'user41'),

-- user42 (완료, 미래 end_date)
('P004', '스마트 TV', '가전제품', 80, 1200, 1500000, '삼성전자', 'user42'),
('P005', '냉장고', '가전제품', 180, 800, 2200000, 'LG전자', 'user42'),
('P006', '세탁기', '가전제품', 90, 700, 1800000, '삼성전자', 'user42'),
-- user43 (완료, 미래 end_date)
('P007', '45인치 LED TV', 'TV', 80, 1200, 1500000, '삼성전자', 'user43'),
('P008', '양문형 냉장고', '주방가전', 180, 800, 2200000, 'LG전자', 'user43'),
('P009', '드럼 세탁기', '생활가전', 90, 700, 1800000, '삼성전자', 'user43'),

-- user46 (완료, 미래 end_date)
('P010', '55인치 QLED TV', 'TV', 80, 1200, 2000000, '삼성전자', 'user46'),
('P011', '양문형 냉장고 플러스', '주방가전', 180, 800, 2500000, 'LG전자', 'user46'),
('P012', '전면 세탁기', '생활가전', 90, 700, 1800000, '삼성전자', 'user46'),

-- user47 (완료, 미래 end_date)
('P013', '65인치 UHD TV', 'TV', 80, 1200, 2500000, '삼성전자', 'user47'),
('P014', '양문형 냉장고 스탠다드', '주방가전', 180, 800, 2000000, 'LG전자', 'user47'),
('P015', '드럼 세탁기 컴팩트', '생활가전', 90, 700, 1600000, '삼성전자', 'user47'),

-- user49 (완료, 미래 end_date)
('P016', '50인치 커브드 TV', 'TV', 80, 1200, 1800000, '삼성전자', 'user49'),
('P017', '모던 양문형 냉장고', '주방가전', 180, 800, 2300000, 'LG전자', 'user49'),
('P018', '대형 드럼 세탁기', '생활가전', 90, 700, 1900000, '삼성전자', 'user49'),

-- user50 (완료, 미래 end_date)
('P019', '75인치 스마트 TV', 'TV', 80, 1200, 3000000, '삼성전자', 'user50'),
('P020', '하이브리드 양문형 냉장고', '주방가전', 180, 800, 2800000, 'LG전자', 'user50'),
('P021', '터보 드럼 세탁기', '생활가전', 90, 700, 2000000, '삼성전자', 'user50'),

-- user51 (완료, 미래 end_date)
('P022', '40인치 HD TV', 'TV', 80, 1200, 1200000, '삼성전자', 'user51'),
('P023', '프리미엄 양문형 냉장고', '주방가전', 180, 800, 2600000, 'LG전자', 'user51'),
('P024', '올인원 드럼 세탁기', '생활가전', 90, 700, 2100000, '삼성전자', 'user51'),

-- user52 (완료, 미래 end_date)
('P025', '32인치 스마트 TV', 'TV', 80, 1200, 900000, '삼성전자', 'user52'),
('P026', '미니 양문형 냉장고', '주방가전', 180, 800, 1800000, 'LG전자', 'user52'),
('P027', '스마트 드럼 세탁기', '생활가전', 90, 700, 1700000, '삼성전자', 'user52'),

-- user53 (완료, 미래 end_date)
('P028', '50인치 OLED TV', 'TV', 80, 1200, 3500000, '삼성전자', 'user53'),
('P029', '스마트 양문형 냉장고', '주방가전', 180, 800, 3000000, 'LG전자', 'user53'),
('P030', '에코 드럼 세탁기', '생활가전', 90, 700, 1600000, '삼성전자', 'user53'),

-- user54 (완료, 미래 end_date)
('P031', '65인치 QLED TV', 'TV', 80, 1200, 2500000, '삼성전자', 'user54'),
('P032', '인스타일 냉장고', '주방가전', 180, 800, 2400000, 'LG전자', 'user54'),
('P033', '스피드 드럼 세탁기', '생활가전', 90, 700, 1800000, '삼성전자', 'user54'),

-- user55 (완료, 미래 end_date)
('P034', '55인치 UHD TV', 'TV', 80, 1200, 2300000, '삼성전자', 'user55'),
('P035', '디럭스 양문형 냉장고', '주방가전', 180, 800, 2700000, 'LG전자', 'user55'),
('P036', '프리미엄 드럼 세탁기', '생활가전', 90, 700, 2200000, '삼성전자', 'user55'),

('P037', '70인치 스마트TV', '가전제품', 90, 1200, 2800000, '삼성전자', 'user49'),
('P038', '프리미엄 냉장고', '주방가전', 180, 800, 3100000, 'LG전자', 'user50'),
('P039', '고급형 드럼 세탁기', '생활가전', 95, 700, 2200000, '삼성전자', 'user51'),

('P040', '4K LED TV', '가전제품', 85, 1400, 1600000, '삼성전자', 'user41'),
('P041', '삼성 노트북', 'IT기기', 20, 400, 1200000, '삼성전자', 'user42'),
('P042', 'LG 워시타워', '가전제품', 190, 700, 3200000, 'LG전자', 'user43'),
('P043', '애플 아이패드', 'IT기기', 20, 250, 1000000, '애플', 'user44'),
('P044', '다이슨 청소기', '생활가전', 120, 300, 900000, '다이슨', 'user45'),
('P045', '위닉스 공기청정기', '생활가전', 60, 350, 600000, '위닉스', 'user46'),
('P046', '삼성 건조기', '가전제품', 140, 600, 1800000, '삼성전자', 'user47'),
('P047', 'LG 스타일러', '가전제품', 185, 650, 2500000, 'LG전자', 'user48'),
('P048', '삼성 스마트워치', 'IT기기', 10, 50, 400000, '삼성전자', 'user49'),
('P049', '애플 맥북', 'IT기기', 15, 350, 2200000, '애플', 'user50'),
('P050', '로지텍 키보드', 'IT기기', 5, 450, 100000, '로지텍', 'user51'),
('P051', '삼성 SSD 1TB', 'IT기기', 2, 100, 180000, '삼성전자', 'user52'),
('P052', 'LG 냉장고', '주방가전', 185, 800, 2400000, 'LG전자', 'user53'),
('P053', '삼성 전자레인지', '주방가전', 40, 600, 300000, '삼성전자', 'user54'),
('P054', '다이슨 헤어드라이어', '생활가전', 30, 150, 500000, '다이슨', 'user55'),
('P055', '삼성 에어드레서', '가전제품', 180, 650, 2700000, '삼성전자', 'user56'),
('P056', '애플 에어팟', 'IT기기', 5, 60, 250000, '애플', 'user42'),
('P057', 'LG 워시건조기', '가전제품', 195, 750, 3300000, 'LG전자', 'user43'),
('P058', '삼성 QLED TV', '가전제품', 85, 1400, 3500000, '삼성전자', 'user44'),
('P059', 'LG OLED TV', '가전제품', 85, 1400, 3800000, 'LG전자', 'user45');


INSERT INTO incoming (count, incoming_date, status, product_id, user_id)
VALUES (100, '2025-07-01', '대기', 'P021', 'user41'),
       (80, '2025-07-02', '대기', 'P022', 'user42'),
       (120, '2025-07-03', '대기', 'P023', 'user43'),
       (110, '2025-07-04', '대기', 'P024', 'user44'),
       (90, '2025-07-05', '대기', 'P025', 'user45'),
       (70, '2025-07-10', '진행중', 'P026', 'user46'),
       (150, '2025-07-11', '진행중', 'P027', 'user47'),
       (60, '2025-07-12', '진행중', 'P028', 'user48'),
       (140, '2025-07-13', '진행중', 'P029', 'user49'),
       (50, '2025-07-14', '진행중', 'P030', 'user50'),
       (100, '2025-04-01', '완료', 'P001', 'user41'),
       (80, '2025-04-02', '완료', 'P002', 'user41'),
       (120, '2025-04-03', '완료', 'P003', 'user42'),
       (110, '2025-04-04', '완료', 'P004', 'user42'),
       (90, '2025-04-05', '완료', 'P005', 'user43'),
       (130, '2025-04-06', '완료', 'P006', 'user44'),
       (70, '2025-04-07', '완료', 'P007', 'user45'),
       (150, '2025-04-08', '완료', 'P008', 'user46'),
       (60, '2025-04-09', '완료', 'P009', 'user47'),
       (140, '2025-04-10', '완료', 'P010', 'user48'),
       (50, '2025-04-11', '완료', 'P011', 'user49'),
       (100, '2025-04-12', '완료', 'P012', 'user50'),
       (90, '2025-04-13', '완료', 'P013', 'user51'),
       (110, '2025-04-14', '완료', 'P014', 'user52'),
       (80, '2025-04-15', '완료', 'P015', 'user53'),
       (120, '2025-04-16', '완료', 'P016', 'user54'),
       (70, '2025-04-17', '완료', 'P017', 'user55'),
       (100, '2025-04-18', '완료', 'P018', 'user56'),
       (60, '2025-04-19', '완료', 'P019', 'user42'),
       (80, '2025-04-20', '완료', 'P020', 'user43'),
       (90, '2025-07-15', '대기', 'P037', 'user49'),
       (100, '2025-07-16', '대기', 'P038', 'user50'),
       (80, '2025-07-17', '대기', 'P039', 'user51'),
       (85, '2025-04-20', '완료', 'P037', 'user49'),
       (95, '2025-04-21', '완료', 'P038', 'user50'),
       (75, '2025-04-22', '완료', 'P039', 'user51'),
       (60, '2025-08-01', '대기', 'P040', 'user41'),
       (80, '2025-08-02', '진행중', 'P041', 'user42'),
       (50, '2025-08-03', '대기', 'P042', 'user43'),
       (70, '2025-08-04', '진행중', 'P043', 'user44'),
       (65, '2025-08-05', '대기', 'P044', 'user45'),
       (75, '2025-08-06', '진행중', 'P045', 'user46'),
       (55, '2025-08-07', '대기', 'P046', 'user47'),
       (85, '2025-08-08', '진행중', 'P047', 'user48'),
       (45, '2025-08-09', '대기', 'P048', 'user49'),
       (95, '2025-08-10', '진행중', 'P049', 'user50'),
       (62, '2025-08-11', '대기', 'P050', 'user51'),
       (72, '2025-08-12', '진행중', 'P051', 'user52'),
       (68, '2025-08-13', '대기', 'P052', 'user53'),
       (78, '2025-08-14', '진행중', 'P053', 'user54'),
       (52, '2025-08-15', '대기', 'P054', 'user55'),
       (82, '2025-08-16', '진행중', 'P055', 'user56'),
       (48, '2025-08-17', '대기', 'P056', 'user42'),
       (88, '2025-08-18', '진행중', 'P057', 'user43'),
       (58, '2025-08-19', '대기', 'P058', 'user44'),
       (78, '2025-08-20', '진행중', 'P059', 'user45');

INSERT INTO stock (count, total_price, user_id, product_id, sector_id, warehouse_id)
VALUES (100, 15000000, 'user41', 'P001', '1A', 1),
       (100, 15000000, 'user41', 'P001', '1A', 1),
       (80, 17600000, 'user41', 'P002', '1A', 1),
       (120, 21600000, 'user42', 'P003', '1B', 1),
       (110, 16500000, 'user42', 'P004', '1B', 1),
       (90, 19800000, 'user43', 'P005', '1C', 1),
       (130, 23400000, 'user44', 'P006', '1C', 1),
       (70, 10500000, 'user45', 'P007', '1D', 1),
       (150, 33000000, 'user46', 'P008', '1D', 1),
       (60, 10800000, 'user47', 'P009', '2A', 2),
       (140, 35000000, 'user48', 'P010', '2A', 2),
       (50, 9000000, 'user49', 'P011', '2B', 2),
       (100, 18000000, 'user50', 'P012', '2B', 2),
       (90, 16000000, 'user51', 'P013', '2C', 2),
       (110, 27500000, 'user52', 'P014', '2C', 2),
       (80, 14400000, 'user53', 'P015', '2D', 2),
       (120, 33600000, 'user54', 'P016', '2D', 2),
       (70, 12600000, 'user55', 'P017', '3A', 3),
       (100, 20000000, 'user56', 'P018', '3A', 3),
       (60, 16200000, 'user42', 'P019', '3B', 3),
       (80, 22400000, 'user43', 'P020', '3B', 3),
       (90, 252000000, 'user49', 'P037', '4A', 4),
       (100, 310000000, 'user50', 'P038', '4B', 4),
       (80, 176000000, 'user51', 'P039', '4C', 4),
       (60, 96000000, 'user41', 'P040', '1A', 1),
       (80, 96000000, 'user42', 'P041', '1B', 1),
       (50, 160000000, 'user43', 'P042', '1C', 1),
       (70, 70000000, 'user44', 'P043', '1D', 1),
       (65, 58500000, 'user45', 'P044', '2A', 2),
       (75, 45000000, 'user46', 'P045', '2B', 2),
       (55, 99000000, 'user47', 'P046', '2C', 2),
       (85, 212500000, 'user48', 'P047', '2D', 2),
       (45, 18000000, 'user49', 'P048', '3A', 3),
       (95, 209000000, 'user50', 'P049', '3B', 3),
       (62, 6200000, 'user51', 'P050', '3C', 3),
       (72, 12960000, 'user52', 'P051', '3D', 3),
       (68, 163200000, 'user53', 'P052', '4A', 4),
       (78, 23400000, 'user54', 'P053', '4B', 4),
       (52, 26000000, 'user55', 'P054', '4C', 4),
       (82, 221400000, 'user56', 'P055', '4D', 4),
       (48, 12000000, 'user42', 'P056', '1A', 1),
       (88, 290400000, 'user43', 'P057', '1B', 1),
       (58, 203000000, 'user44', 'P058', '1C', 1),
       (78, 296400000, 'user45', 'P059', '1D', 1);


INSERT INTO outgoing (count, outgoing_date, status, user_id, stock_num)
VALUES (3, '2025-07-01', '대기', 'user41', 1),
       (2, '2025-07-02', '대기', 'user42', 2),
       (4, '2025-07-03', '대기', 'user43', 3),
       (5, '2025-07-04', '대기', 'user44', 4),
       (2, '2025-07-05', '대기', 'user45', 5),
       (4, '2025-07-10', '진행중', 'user46', 6),
       (5, '2025-07-11', '진행중', 'user47', 7),
       (6, '2025-07-12', '진행중', 'user48', 8),
       (3, '2025-07-13', '진행중', 'user49', 9),
       (4, '2025-07-14', '진행중', 'user50', 10),
       (3, '2025-04-10', '완료', 'user41', 1),
       (2, '2025-04-11', '완료', 'user41', 2),
       (4, '2025-04-12', '완료', 'user42', 3),
       (5, '2025-04-13', '완료', 'user42', 4),
       (2, '2025-04-14', '완료', 'user43', 5),
       (3, '2025-04-15', '완료', 'user44', 6),
       (1, '2025-04-16', '완료', 'user45', 7),
       (5, '2025-04-17', '완료', 'user46', 8),
       (2, '2025-04-18', '완료', 'user47', 9),
       (6, '2025-04-19', '완료', 'user48', 10),
       (3, '2025-04-20', '완료', 'user49', 11),
       (4, '2025-04-21', '완료', 'user50', 12),
       (1, '2025-04-22', '완료', 'user51', 13),
       (5, '2025-04-23', '완료', 'user52', 14),
       (2, '2025-04-24', '완료', 'user53', 15),
       (6, '2025-04-25', '완료', 'user54', 16),
       (3, '2025-04-26', '완료', 'user55', 17),
       (5, '2025-04-27', '완료', 'user56', 18),
       (2, '2025-04-28', '완료', 'user42', 19),
       (4, '2025-04-29', '완료', 'user43', 20),
       (2, '2025-07-18', '대기', 'user49', 21),
       (3, '2025-07-19', '대기', 'user50', 22),
       (1, '2025-07-20', '대기', 'user51', 23),
       (2, '2025-04-23', '완료', 'user49', 21),
       (3, '2025-04-24', '완료', 'user50', 22),
       (1, '2025-04-25', '완료', 'user51', 23),
       (2, '2025-08-21', '대기', 'user41', 24),
       (3, '2025-08-22', '진행중', 'user42', 25),
       (4, '2025-08-23', '대기', 'user43', 26),
       (2, '2025-08-24', '진행중', 'user44', 27),
       (3, '2025-08-25', '대기', 'user45', 28),
       (2, '2025-08-26', '진행중', 'user46', 29),
       (4, '2025-08-27', '대기', 'user47', 30),
       (5, '2025-08-28', '진행중', 'user48', 31),
       (3, '2025-08-29', '대기', 'user49', 32),
       (2, '2025-08-30', '진행중', 'user50', 33),
       (5, '2025-08-31', '대기', 'user51', 34),
       (1, '2025-09-01', '진행중', 'user52', 35),
       (3, '2025-09-02', '대기', 'user53', 36),
       (2, '2025-09-03', '진행중', 'user54', 37),
       (4, '2025-09-04', '대기', 'user55', 38),
       (2, '2025-09-05', '진행중', 'user56', 39),
       (5, '2025-09-06', '대기', 'user42', 40),
       (3, '2025-09-07', '진행중', 'user43', 41),
       (2, '2025-09-08', '대기', 'user44', 42),
       (4, '2025-09-09', '진행중', 'user45', 43);
#
# INSERT INTO stock_history (product_id, sector_id, count, change_date, change_type, admin_id, stock_num, incoming_num,
#                            outgoing_num)
# VALUES
DELETE FROM martgodb.rent_history WHERE rent_num = 84 AND sector_id LIKE '1A' ESCAPE '#' AND warehouse_id = 1 AND user_id LIKE 'user54' ESCAPE '#';
DELETE FROM martgodb.rent_history WHERE rent_num = 83 AND sector_id LIKE '1A' ESCAPE '#' AND warehouse_id = 1 AND user_id LIKE 'user46' ESCAPE '#';

UPDATE martgodb.user t SET t.role = '회원', t.admin_id = null WHERE t.user_id LIKE 'user46' ESCAPE '#';
UPDATE martgodb.user t SET t.role = '회원', t.admin_id = null WHERE t.user_id LIKE 'user56' ESCAPE '#';

DELETE FROM martgodb.incoming WHERE incoming_num = 18;
DELETE FROM martgodb.incoming WHERE incoming_num = 26;
DELETE FROM martgodb.incoming WHERE incoming_num = 42;
DELETE FROM martgodb.incoming WHERE incoming_num = 6;
DELETE FROM martgodb.incoming WHERE incoming_num = 50;

DELETE FROM martgodb.outgoing WHERE outgoing_num = 18;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 26;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 6;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 42;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 50;

DELETE FROM martgodb.stock WHERE stock_num = 38;
DELETE FROM martgodb.stock WHERE stock_num = 30;
DELETE FROM martgodb.stock WHERE stock_num = 9;
DELETE FROM martgodb.stock WHERE stock_num = 17;
UPDATE martgodb.stock t SET t.sector_id = '1C' WHERE t.stock_num = 1;
UPDATE martgodb.stock t SET t.sector_id = '1C' WHERE t.stock_num = 2;

DELETE FROM martgodb.rent_history WHERE rent_num = 123 AND sector_id LIKE '4B' ESCAPE '#' AND warehouse_id = 4 AND user_id LIKE 'user41' ESCAPE '#';
DELETE FROM martgodb.rent_history WHERE rent_num = 107 AND sector_id LIKE '3A' ESCAPE '#' AND warehouse_id = 3 AND user_id LIKE 'user41' ESCAPE '#';
DELETE FROM martgodb.rent_history WHERE rent_num = 90 AND sector_id LIKE '1C' ESCAPE '#' AND warehouse_id = 1 AND user_id LIKE 'user41' ESCAPE '#';

UPDATE martgodb.user t SET t.role = '회원', t.admin_id = null WHERE t.user_id LIKE 'user41' ESCAPE '#';

DELETE FROM martgodb.incoming WHERE incoming_num = 1;
DELETE FROM martgodb.incoming WHERE incoming_num = 12;
DELETE FROM martgodb.incoming WHERE incoming_num = 11;
DELETE FROM martgodb.incoming WHERE incoming_num = 37;

DELETE FROM martgodb.outgoing WHERE outgoing_num = 11;

DELETE FROM martgodb.outgoing WHERE outgoing_num = 1;

DELETE FROM martgodb.outgoing WHERE outgoing_num = 12;

DELETE FROM martgodb.outgoing WHERE outgoing_num = 37;

DELETE FROM martgodb.stock WHERE stock_num = 25;
DELETE FROM martgodb.stock WHERE stock_num = 1;
DELETE FROM martgodb.stock WHERE stock_num = 3;
DELETE FROM martgodb.stock WHERE stock_num = 2;
;
DELETE FROM martgodb.stock WHERE stock_num = 41;
UPDATE martgodb.user t SET t.role = '회원', t.admin_id = null WHERE t.user_id LIKE 'user42' ESCAPE '#';
DELETE FROM martgodb.rent_history WHERE rent_num = 90 AND sector_id LIKE '1C' ESCAPE '#' AND warehouse_id = 1 AND user_id LIKE 'user41' ESCAPE '#';
DELETE FROM martgodb.rent_history WHERE rent_num = 107 AND sector_id LIKE '3A' ESCAPE '#' AND warehouse_id = 3 AND user_id LIKE 'user41' ESCAPE '#';
DELETE FROM martgodb.rent_history WHERE rent_num = 123 AND sector_id LIKE '4B' ESCAPE '#' AND warehouse_id = 4 AND user_id LIKE 'user41' ESCAPE '#';
DELETE FROM martgodb.incoming WHERE incoming_num = 53;
DELETE FROM martgodb.incoming WHERE incoming_num = 2;
DELETE FROM martgodb.incoming WHERE incoming_num = 13;
DELETE FROM martgodb.incoming WHERE incoming_num = 14;
DELETE FROM martgodb.incoming WHERE incoming_num = 38;
DELETE FROM martgodb.incoming WHERE incoming_num = 29;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 53;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 2;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 13;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 14;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 29;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 38;
DELETE FROM martgodb.stock WHERE stock_num = 20;
DELETE FROM martgodb.stock WHERE stock_num = 4;
DELETE FROM martgodb.stock WHERE stock_num = 26;
DELETE FROM martgodb.stock WHERE stock_num = 5;

DELETE FROM martgodb.rent_history WHERE rent_num = 82 AND sector_id LIKE '1A' ESCAPE '#' AND warehouse_id = 1 AND user_id LIKE 'user44' ESCAPE '#';
UPDATE martgodb.user t SET t.role = '회원', t.admin_id = null WHERE t.user_id LIKE 'user44' ESCAPE '#';
UPDATE martgodb.user t SET t.role = '거래처' WHERE t.user_id LIKE 'user44' ESCAPE '#';
DELETE FROM martgodb.incoming WHERE incoming_num = 40;
DELETE FROM martgodb.incoming WHERE incoming_num = 16;
DELETE FROM martgodb.incoming WHERE incoming_num = 4;
DELETE FROM martgodb.incoming WHERE incoming_num = 55;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 40;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 4;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 16;
DELETE FROM martgodb.outgoing WHERE outgoing_num = 55;
DELETE FROM martgodb.stock WHERE stock_num = 7;
DELETE FROM martgodb.stock WHERE stock_num = 28;
DELETE FROM martgodb.stock WHERE stock_num = 43;